export const blog = [
  {
    title: "ری اکت چیست",
    image: "blog-image1.png",
    description: `ری اکت (reactjs) اساسا یک کتابخونه open-source جاوا اسکریپتی برای ساخت رابط کاربری(user interfaces) برای single page applications(اپلیکیشن های تک صفحه ای) است.این کتابخونه برای مدیریت لایه View برای وب استفاده می شود.همچنین React این امکان رو در اختیار ما میذاره که reusable UI components(کامپوننت های قابل استفاده مجدد رابط کاریری) ایجاد کنیم.React  در ابتدا توسط Jordan Walke یکی از مهندسین ارشد فیسبوک ایجاد شد.React ابتدا در سال 2011 در فیسبوک مورد استفاده قرار گرفت و سپس در سال 2012 در اینستاگرام استفاده شد.
      ری اکت این امکان را در اختیار توسعه دهندگان می گذارد که وب اپلیکیشن های خیلی بزرگ که می تواند date را تغییر بدهد،بدون reload صفحه ایجاد کنند.مهم ترین اهداف React را میتوان سادگی،سرعت و مقیاس پذیر بودن دانست.تمرکز اصلی React بر روی رابط کاربری است و فقط در لایه View  در معماری MVC مطابقت دارد.این کتابخانه می تواند با کتابخانه های و فریمورک های دیگر جاوا اسکریپت مثل Angular ترکیب و مورد استفاده قرار گیرد.`,
  },
  {
    title: "چرا نکست جی اس؟",
    image: "blog-image1.png",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
];

export const about = {
  text1:
    "حسینم متولد 5 آبان 1373، حفرفه مورد علاقه من توسعه دهنده وب سایته و به مدت سه سال در این حرفه مشغول به کار هستم. کار من قسمت مورد علاقه زندگی من رو تشکیل میده. انقد به کارم علاقه دارم که وقتی به کد زدن و طراحی مشغول میشم زمان از دستم خارج میشه. ورزش، مطالعه مقالات و شرکت در کلاس های آنلاین در زمینه برنامه نویسی و تکنیک هاش، از تفریحات مورد علاقه من هستند.",
  text2:
    "اولین پروژه حرفه ای من از سال 96 شروع شد و من وارد دنیای حرفه ای وب شدم و همچنان این مسیر رو ادامه میدم، و در حال حاضر در زمینه در زمینه برنامه نویسی سمت کاربر (front-end) فعالیت دارم.",
};

export const resume = [
  {
    date: 1396,
    time_ago: "1396-1397",
    text:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط",
  },
  {
    date: 1397,
    time_ago: "1397-1398",
    text:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده",
  },
  {
    date: 1398,
    time_ago: "1398-1399",
    text:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده",
  },
  {
    date: 1399,
    time_ago: "1399",
    text:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با",
  },
];

export const skills = [
  {
    name: "VueJS",
    image: "vuejs.png",
  },
  {
    name: "Javascritp",
    image: "javascript.png",
  },
  {
    name: "Typescript",
    image: "typescript.png",
  },
  {
    name: "CSS3 + HTML5",
    image: "html-css.png",
  },
  {
    name: "ReactJS",
    image: "react.png",
  },
  {
    name: "NodeJS",
    image: "nodejs.png",
  },
];

export const contactData = {
  section_info: 'برای من پیام ارسال کنین برای ارزیابی و بررسی پروژه یا هر سوالی در خصوص این موضوع یا سوال درباره برنامه نویسی رو میتونین',
  personal_info: [
    {
      title: 'آدرس',
      text: 'ایران، تهران'
    },
    {
      title: 'ایمیل',
      text: 'hosein.sharifinia@gmail.com'
    },
    {
      title: 'وبسایت',
      text: 'www.hoseinsharfinia.ir'
    }
  ]
}
